susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define FMPI2C1_SCL_PB10_ PB10,GPIO_AF9
#define FMPI2C1_SCL_PB15_ PB15,GPIO_AF4
#define FMPI2C1_SCL_PC6_ PC6,GPIO_AF4
#define FMPI2C1_SCL_PD12_ PD12,GPIO_AF4
#define FMPI2C1_SCL_PD14_ PD14,GPIO_AF4
#define FMPI2C1_SCL_PF14_ PF14,GPIO_AF4
#define _FMPI2C1_SCL_PB10_ 1
#define _FMPI2C1_SCL_PB15_ 1
#define _FMPI2C1_SCL_PC6_ 1
#define _FMPI2C1_SCL_PD12_ 1
#define _FMPI2C1_SCL_PD14_ 1
#define _FMPI2C1_SCL_PF14_ 1

#define FMPI2C1_SDA_PB14_ PB14,GPIO_AF4
#define FMPI2C1_SDA_PB3_ PB3,GPIO_AF4
#define FMPI2C1_SDA_PC7_ PC7,GPIO_AF4
#define FMPI2C1_SDA_PD13_ PD13,GPIO_AF4
#define FMPI2C1_SDA_PD15_ PD15,GPIO_AF4
#define FMPI2C1_SDA_PF15_ PF15,GPIO_AF4
#define _FMPI2C1_SDA_PB14_ 1
#define _FMPI2C1_SDA_PB3_ 1
#define _FMPI2C1_SDA_PC7_ 1
#define _FMPI2C1_SDA_PD13_ 1
#define _FMPI2C1_SDA_PD15_ 1
#define _FMPI2C1_SDA_PF15_ 1

#define FMPI2C1_SMBA_PB13_ PB13,GPIO_AF4
#define FMPI2C1_SMBA_PC5_ PC5,GPIO_AF4
#define FMPI2C1_SMBA_PD11_ PD11,GPIO_AF4
#define FMPI2C1_SMBA_PF13_ PF13,GPIO_AF4
#define _FMPI2C1_SMBA_PB13_ 1
#define _FMPI2C1_SMBA_PC5_ 1
#define _FMPI2C1_SMBA_PD11_ 1
#define _FMPI2C1_SMBA_PF13_ 1

#define FSMC_A0_PC3_ PC3,GPIO_AF12
#define FSMC_A0_PF0_ PF0,GPIO_AF12
#define _FSMC_A0_PC3_ 1
#define _FSMC_A0_PF0_ 1

#define FSMC_A1_PF1_ PF1,GPIO_AF12
#define _FSMC_A1_PF1_ 1

#define FSMC_A10_PG0_ PG0,GPIO_AF12
#define _FSMC_A10_PG0_ 1

#define FSMC_A11_PG1_ PG1,GPIO_AF12
#define _FSMC_A11_PG1_ 1

#define FSMC_A12_PG2_ PG2,GPIO_AF12
#define _FSMC_A12_PG2_ 1

#define FSMC_A13_PG3_ PG3,GPIO_AF12
#define _FSMC_A13_PG3_ 1

#define FSMC_A14_PG4_ PG4,GPIO_AF12
#define _FSMC_A14_PG4_ 1

#define FSMC_A15_PG5_ PG5,GPIO_AF12
#define _FSMC_A15_PG5_ 1

#define FSMC_A16_PD11_ PD11,GPIO_AF12
#define _FSMC_A16_PD11_ 1

#define FSMC_A17_PD12_ PD12,GPIO_AF12
#define _FSMC_A17_PD12_ 1

#define FSMC_A18_PD13_ PD13,GPIO_AF12
#define _FSMC_A18_PD13_ 1

#define FSMC_A19_PE3_ PE3,GPIO_AF12
#define _FSMC_A19_PE3_ 1

#define FSMC_A2_PF2_ PF2,GPIO_AF12
#define _FSMC_A2_PF2_ 1

#define FSMC_A20_PE4_ PE4,GPIO_AF12
#define _FSMC_A20_PE4_ 1

#define FSMC_A21_PE5_ PE5,GPIO_AF12
#define _FSMC_A21_PE5_ 1

#define FSMC_A22_PE6_ PE6,GPIO_AF12
#define _FSMC_A22_PE6_ 1

#define FSMC_A23_PE2_ PE2,GPIO_AF12
#define _FSMC_A23_PE2_ 1

#define FSMC_A24_PG13_ PG13,GPIO_AF12
#define _FSMC_A24_PG13_ 1

#define FSMC_A25_PG14_ PG14,GPIO_AF12
#define _FSMC_A25_PG14_ 1

#define FSMC_A3_PF3_ PF3,GPIO_AF12
#define _FSMC_A3_PF3_ 1

#define FSMC_A4_PF4_ PF4,GPIO_AF12
#define _FSMC_A4_PF4_ 1

#define FSMC_A5_PF5_ PF5,GPIO_AF12
#define _FSMC_A5_PF5_ 1

#define FSMC_A6_PF12_ PF12,GPIO_AF12
#define _FSMC_A6_PF12_ 1

#define FSMC_A7_PF13_ PF13,GPIO_AF12
#define _FSMC_A7_PF13_ 1

#define FSMC_A8_PF14_ PF14,GPIO_AF12
#define _FSMC_A8_PF14_ 1

#define FSMC_A9_PF15_ PF15,GPIO_AF12
#define _FSMC_A9_PF15_ 1

#define FSMC_CLK_PD3_ PD3,GPIO_AF12
#define _FSMC_CLK_PD3_ 1

#define FSMC_D0_PB14_ PB14,GPIO_AF10
#define FSMC_D0_PD14_ PD14,GPIO_AF12
#define _FSMC_D0_PB14_ 1
#define _FSMC_D0_PD14_ 1

#define FSMC_D1_PC6_ PC6,GPIO_AF10
#define FSMC_D1_PD15_ PD15,GPIO_AF12
#define _FSMC_D1_PC6_ 1
#define _FSMC_D1_PD15_ 1

#define FSMC_D10_PE13_ PE13,GPIO_AF12
#define _FSMC_D10_PE13_ 1

#define FSMC_D11_PE14_ PE14,GPIO_AF12
#define _FSMC_D11_PE14_ 1

#define FSMC_D12_PE15_ PE15,GPIO_AF12
#define _FSMC_D12_PE15_ 1

#define FSMC_D13_PB12_ PB12,GPIO_AF12
#define FSMC_D13_PD8_ PD8,GPIO_AF12
#define _FSMC_D13_PB12_ 1
#define _FSMC_D13_PD8_ 1

#define FSMC_D14_PD9_ PD9,GPIO_AF12
#define _FSMC_D14_PD9_ 1

#define FSMC_D15_PD10_ PD10,GPIO_AF12
#define _FSMC_D15_PD10_ 1

#define FSMC_D2_PC11_ PC11,GPIO_AF10
#define FSMC_D2_PD0_ PD0,GPIO_AF12
#define _FSMC_D2_PC11_ 1
#define _FSMC_D2_PD0_ 1

#define FSMC_D3_PC12_ PC12,GPIO_AF10
#define FSMC_D3_PD1_ PD1,GPIO_AF12
#define _FSMC_D3_PC12_ 1
#define _FSMC_D3_PD1_ 1

#define FSMC_D4_PA2_ PA2,GPIO_AF12
#define FSMC_D4_PE7_ PE7,GPIO_AF12
#define _FSMC_D4_PA2_ 1
#define _FSMC_D4_PE7_ 1

#define FSMC_D5_PA3_ PA3,GPIO_AF12
#define FSMC_D5_PE8_ PE8,GPIO_AF12
#define _FSMC_D5_PA3_ 1
#define _FSMC_D5_PE8_ 1

#define FSMC_D6_PA4_ PA4,GPIO_AF12
#define FSMC_D6_PE9_ PE9,GPIO_AF12
#define _FSMC_D6_PA4_ 1
#define _FSMC_D6_PE9_ 1

#define FSMC_D7_PA5_ PA5,GPIO_AF12
#define FSMC_D7_PE10_ PE10,GPIO_AF12
#define _FSMC_D7_PA5_ 1
#define _FSMC_D7_PE10_ 1

#define FSMC_D8_PE11_ PE11,GPIO_AF12
#define _FSMC_D8_PE11_ 1

#define FSMC_D9_PE12_ PE12,GPIO_AF12
#define _FSMC_D9_PE12_ 1

#define FSMC_DA0_PB14_ PB14,GPIO_AF10
#define FSMC_DA0_PD14_ PD14,GPIO_AF12
#define _FSMC_DA0_PB14_ 1
#define _FSMC_DA0_PD14_ 1

#define FSMC_DA1_PC6_ PC6,GPIO_AF10
#define FSMC_DA1_PD15_ PD15,GPIO_AF12
#define _FSMC_DA1_PC6_ 1
#define _FSMC_DA1_PD15_ 1

#define FSMC_DA10_PE13_ PE13,GPIO_AF12
#define _FSMC_DA10_PE13_ 1

#define FSMC_DA11_PE14_ PE14,GPIO_AF12
#define _FSMC_DA11_PE14_ 1

#define FSMC_DA12_PE15_ PE15,GPIO_AF12
#define _FSMC_DA12_PE15_ 1

#define FSMC_DA13_PB12_ PB12,GPIO_AF12
#define FSMC_DA13_PD8_ PD8,GPIO_AF12
#define _FSMC_DA13_PB12_ 1
#define _FSMC_DA13_PD8_ 1

#define FSMC_DA14_PD9_ PD9,GPIO_AF12
#define _FSMC_DA14_PD9_ 1

#define FSMC_DA15_PD10_ PD10,GPIO_AF12
#define _FSMC_DA15_PD10_ 1

#define FSMC_DA2_PC11_ PC11,GPIO_AF10
#define FSMC_DA2_PD0_ PD0,GPIO_AF12
#define _FSMC_DA2_PC11_ 1
#define _FSMC_DA2_PD0_ 1

#define FSMC_DA3_PC12_ PC12,GPIO_AF10
#define FSMC_DA3_PD1_ PD1,GPIO_AF12
#define _FSMC_DA3_PC12_ 1
#define _FSMC_DA3_PD1_ 1

#define FSMC_DA4_PA2_ PA2,GPIO_AF12
#define FSMC_DA4_PE7_ PE7,GPIO_AF12
#define _FSMC_DA4_PA2_ 1
#define _FSMC_DA4_PE7_ 1

#define FSMC_DA5_PA3_ PA3,GPIO_AF12
#define FSMC_DA5_PE8_ PE8,GPIO_AF12
#define _FSMC_DA5_PA3_ 1
#define _FSMC_DA5_PE8_ 1

#define FSMC_DA6_PA4_ PA4,GPIO_AF12
#define FSMC_DA6_PE9_ PE9,GPIO_AF12
#define _FSMC_DA6_PA4_ 1
#define _FSMC_DA6_PE9_ 1

#define FSMC_DA7_PA5_ PA5,GPIO_AF12
#define FSMC_DA7_PE10_ PE10,GPIO_AF12
#define _FSMC_DA7_PA5_ 1
#define _FSMC_DA7_PE10_ 1

#define FSMC_DA8_PE11_ PE11,GPIO_AF12
#define _FSMC_DA8_PE11_ 1

#define FSMC_DA9_PE12_ PE12,GPIO_AF12
#define _FSMC_DA9_PE12_ 1

#define FSMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FSMC_NBL0_PE0_ 1

#define FSMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FSMC_NBL1_PE1_ 1

