susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define FSMC_NE1_PD7_ PD7,GPIO_AF12
#define _FSMC_NE1_PD7_ 1

#define FSMC_NE2_PG9_ PG9,GPIO_AF12
#define _FSMC_NE2_PG9_ 1

#define FSMC_NE3_PG10_ PG10,GPIO_AF12
#define _FSMC_NE3_PG10_ 1

#define FSMC_NE4_PC4_ PC4,GPIO_AF12
#define FSMC_NE4_PG12_ PG12,GPIO_AF12
#define _FSMC_NE4_PC4_ 1
#define _FSMC_NE4_PG12_ 1

#define FSMC_NL_PB7_ PB7,GPIO_AF12
#define _FSMC_NL_PB7_ 1

#define FSMC_NOE_PC5_ PC5,GPIO_AF12
#define FSMC_NOE_PD4_ PD4,GPIO_AF12
#define _FSMC_NOE_PC5_ 1
#define _FSMC_NOE_PD4_ 1

#define FSMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FSMC_NWAIT_PD6_ 1

#define FSMC_NWE_PC2_ PC2,GPIO_AF12
#define FSMC_NWE_PD2_ PD2,GPIO_AF10
#define FSMC_NWE_PD5_ PD5,GPIO_AF12
#define _FSMC_NWE_PC2_ 1
#define _FSMC_NWE_PD2_ 1
#define _FSMC_NWE_PD5_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PF1_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PB3_ PB3,GPIO_AF9
#define I2C2_SDA_PB9_ PB9,GPIO_AF9
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB3_ 1
#define _I2C2_SDA_PB9_ 1
#define _I2C2_SDA_PF0_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF4
#define _I2C3_SCL_PA8_ 1

#define I2C3_SDA_PB4_ PB4,GPIO_AF9
#define I2C3_SDA_PB8_ PB8,GPIO_AF9
#define I2C3_SDA_PC9_ PC9,GPIO_AF4
#define _I2C3_SDA_PB4_ 1
#define _I2C3_SDA_PB8_ 1
#define _I2C3_SDA_PC9_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1

#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PC4_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF5
#define I2S1_SD_PB5_ PB5,GPIO_AF5
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1

#define I2S2_CK_PA9_ PA9,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PC7_ PC7,GPIO_AF5
#define I2S2_CK_PD3_ PD3,GPIO_AF5
#define _I2S2_CK_PA9_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PC7_ 1
#define _I2S2_CK_PD3_ 1

#define I2S2_MCK_PA3_ PA3,GPIO_AF5
#define I2S2_MCK_PA6_ PA6,GPIO_AF6
#define I2S2_MCK_PC6_ PC6,GPIO_AF5
#define _I2S2_MCK_PA3_ 1
#define _I2S2_MCK_PA6_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PA10_ PA10,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PC3_ PC3,GPIO_AF5
#define _I2S2_SD_PA10_ 1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1

#define I2S2_ext_SD_PB14_ PB14,GPIO_AF6
#define I2S2_ext_SD_PC2_ PC2,GPIO_AF6
#define _I2S2_ext_SD_PB14_ 1
#define _I2S2_ext_SD_PC2_ 1

#define I2S3_CK_PB12_ PB12,GPIO_AF5
#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB12_ 1
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PB10_ PB10,GPIO_AF6
#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PB10_ 1
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define I2S3_SD_PD6_ PD6,GPIO_AF5
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1
#define _I2S3_SD_PD6_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S3_ext_SD_PB4_ PB4,GPIO_AF5
#define I2S3_ext_SD_PC11_ PC11,GPIO_AF5
#define _I2S3_ext_SD_PB4_ 1
#define _I2S3_ext_SD_PC11_ 1

#define I2S4_CK_PB13_ PB13,GPIO_AF6
#define I2S4_CK_PE12_ PE12,GPIO_AF5
#define I2S4_CK_PE2_ PE2,GPIO_AF5
#define _I2S4_CK_PB13_ 1
#define _I2S4_CK_PE12_ 1
#define _I2S4_CK_PE2_ 1

#define I2S4_SD_PA1_ PA1,GPIO_AF5
#define I2S4_SD_PE14_ PE14,GPIO_AF5
#define I2S4_SD_PE6_ PE6,GPIO_AF5
#define _I2S4_SD_PA1_ 1
#define _I2S4_SD_PE14_ 1
#define _I2S4_SD_PE6_ 1

#define I2S4_WS_PB12_ PB12,GPIO_AF6
#define I2S4_WS_PE11_ PE11,GPIO_AF5
#define I2S4_WS_PE4_ PE4,GPIO_AF5
#define _I2S4_WS_PB12_ 1
#define _I2S4_WS_PE11_ 1
#define _I2S4_WS_PE4_ 1

#define I2S5_CK_PB0_ PB0,GPIO_AF6
#define I2S5_CK_PE12_ PE12,GPIO_AF6
#define I2S5_CK_PE2_ PE2,GPIO_AF6
#define _I2S5_CK_PB0_ 1
#define _I2S5_CK_PE12_ 1
#define _I2S5_CK_PE2_ 1

#define I2S5_SD_PA10_ PA10,GPIO_AF6
#define I2S5_SD_PB8_ PB8,GPIO_AF6
#define I2S5_SD_PE14_ PE14,GPIO_AF6
#define I2S5_SD_PE6_ PE6,GPIO_AF6
#define _I2S5_SD_PA10_ 1
#define _I2S5_SD_PB8_ 1
#define _I2S5_SD_PE14_ 1
#define _I2S5_SD_PE6_ 1

#define I2S5_WS_PB1_ PB1,GPIO_AF6
#define I2S5_WS_PE11_ PE11,GPIO_AF6
#define I2S5_WS_PE4_ PE4,GPIO_AF6
#define _I2S5_WS_PB1_ 1
#define _I2S5_WS_PE11_ 1
#define _I2S5_WS_PE4_ 1

#define I2S_CKIN_PA2_ PA2,GPIO_AF5
#define I2S_CKIN_PB11_ PB11,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA2_ 1
#define _I2S_CKIN_PB11_ 1
#define _I2S_CKIN_PC9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PB8_ PB8,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PB8_ 1
#define _LPTIM1_OUT_PC1_ 1

#define QUADSPI_BK1_IO0_PC9_ PC9,GPIO_AF9
#define QUADSPI_BK1_IO0_PD11_ PD11,GPIO_AF9
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI_BK1_IO0_PC9_ 1
#define _QUADSPI_BK1_IO0_PD11_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1

#define QUADSPI_BK1_IO1_PC10_ PC10,GPIO_AF9
#define QUADSPI_BK1_IO1_PD12_ PD12,GPIO_AF9
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI_BK1_IO1_PC10_ 1
#define _QUADSPI_BK1_IO1_PD12_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1

