susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define QUADSPI_BK1_IO2_PC8_ PC8,GPIO_AF9
#define QUADSPI_BK1_IO2_PE2_ PE2,GPIO_AF9
#define QUADSPI_BK1_IO2_PF7_ PF7,GPIO_AF9
#define _QUADSPI_BK1_IO2_PC8_ 1
#define _QUADSPI_BK1_IO2_PE2_ 1
#define _QUADSPI_BK1_IO2_PF7_ 1

#define QUADSPI_BK1_IO3_PA1_ PA1,GPIO_AF9
#define QUADSPI_BK1_IO3_PD13_ PD13,GPIO_AF9
#define QUADSPI_BK1_IO3_PF6_ PF6,GPIO_AF9
#define _QUADSPI_BK1_IO3_PA1_ 1
#define _QUADSPI_BK1_IO3_PD13_ 1
#define _QUADSPI_BK1_IO3_PF6_ 1

#define QUADSPI_BK1_NCS_PB6_ PB6,GPIO_AF10
#define QUADSPI_BK1_NCS_PG6_ PG6,GPIO_AF10
#define _QUADSPI_BK1_NCS_PB6_ 1
#define _QUADSPI_BK1_NCS_PG6_ 1

#define QUADSPI_BK2_IO0_PA6_ PA6,GPIO_AF10
#define QUADSPI_BK2_IO0_PE7_ PE7,GPIO_AF10
#define _QUADSPI_BK2_IO0_PA6_ 1
#define _QUADSPI_BK2_IO0_PE7_ 1

#define QUADSPI_BK2_IO1_PA7_ PA7,GPIO_AF10
#define QUADSPI_BK2_IO1_PE8_ PE8,GPIO_AF10
#define _QUADSPI_BK2_IO1_PA7_ 1
#define _QUADSPI_BK2_IO1_PE8_ 1

#define QUADSPI_BK2_IO2_PC4_ PC4,GPIO_AF10
#define QUADSPI_BK2_IO2_PE9_ PE9,GPIO_AF10
#define QUADSPI_BK2_IO2_PG9_ PG9,GPIO_AF9
#define _QUADSPI_BK2_IO2_PC4_ 1
#define _QUADSPI_BK2_IO2_PE9_ 1
#define _QUADSPI_BK2_IO2_PG9_ 1

#define QUADSPI_BK2_IO3_PC5_ PC5,GPIO_AF10
#define QUADSPI_BK2_IO3_PE10_ PE10,GPIO_AF10
#define QUADSPI_BK2_IO3_PG14_ PG14,GPIO_AF9
#define _QUADSPI_BK2_IO3_PC5_ 1
#define _QUADSPI_BK2_IO3_PE10_ 1
#define _QUADSPI_BK2_IO3_PG14_ 1

#define QUADSPI_BK2_NCS_PC11_ PC11,GPIO_AF9
#define _QUADSPI_BK2_NCS_PC11_ 1

#define QUADSPI_CLK_PB1_ PB1,GPIO_AF9
#define QUADSPI_CLK_PB2_ PB2,GPIO_AF9
#define QUADSPI_CLK_PD3_ PD3,GPIO_AF9
#define _QUADSPI_CLK_PB1_ 1
#define _QUADSPI_CLK_PB2_ 1
#define _QUADSPI_CLK_PD3_ 1

#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_1_PA8_ 1

#define RCC_MCO_2_PC9_ PC9,GPIO_AF0
#define _RCC_MCO_2_PC9_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SAI1_FS_A_PB5_ PB5,GPIO_AF10
#define SAI1_FS_A_PE6_ PE6,GPIO_AF7
#define _SAI1_FS_A_PB5_ 1
#define _SAI1_FS_A_PE6_ 1

#define SAI1_FS_B_PC3_ PC3,GPIO_AF7
#define SAI1_FS_B_PF9_ PF9,GPIO_AF7
#define _SAI1_FS_B_PC3_ 1
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PA15_ PA15,GPIO_AF10
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF7
#define _SAI1_MCLK_A_PA15_ 1
#define _SAI1_MCLK_A_PE2_ 1

#define SAI1_MCLK_B_PC0_ PC0,GPIO_AF7
#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF7
#define _SAI1_MCLK_B_PC0_ 1
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PB4_ PB4,GPIO_AF10
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF7
#define _SAI1_SCK_A_PB4_ 1
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PC2_ PC2,GPIO_AF7
#define SAI1_SCK_B_PF8_ PF8,GPIO_AF7
#define _SAI1_SCK_B_PC2_ 1
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PB3_ PB3,GPIO_AF10
#define SAI1_SD_A_PE4_ PE4,GPIO_AF7
#define _SAI1_SD_A_PB3_ 1
#define _SAI1_SD_A_PE4_ 1

#define SAI1_SD_B_PA3_ PA3,GPIO_AF10
#define SAI1_SD_B_PC1_ PC1,GPIO_AF7
#define SAI1_SD_B_PE3_ PE3,GPIO_AF7
#define SAI1_SD_B_PF6_ PF6,GPIO_AF7
#define _SAI1_SD_B_PA3_ 1
#define _SAI1_SD_B_PC1_ 1
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PF6_ 1

#define SDIO_CK_PB15_ PB15,GPIO_AF12
#define SDIO_CK_PC12_ PC12,GPIO_AF12
#define _SDIO_CK_PB15_ 1
#define _SDIO_CK_PC12_ 1

#define SDIO_CMD_PA6_ PA6,GPIO_AF12
#define SDIO_CMD_PD2_ PD2,GPIO_AF12
#define _SDIO_CMD_PA6_ 1
#define _SDIO_CMD_PD2_ 1

#define SDIO_D0_PB4_ PB4,GPIO_AF12
#define SDIO_D0_PB6_ PB6,GPIO_AF12
#define SDIO_D0_PC8_ PC8,GPIO_AF12
#define _SDIO_D0_PB4_ 1
#define _SDIO_D0_PB6_ 1
#define _SDIO_D0_PC8_ 1

#define SDIO_D1_PA8_ PA8,GPIO_AF12
#define SDIO_D1_PC9_ PC9,GPIO_AF12
#define _SDIO_D1_PA8_ 1
#define _SDIO_D1_PC9_ 1

#define SDIO_D2_PA9_ PA9,GPIO_AF12
#define SDIO_D2_PC10_ PC10,GPIO_AF12
#define _SDIO_D2_PA9_ 1
#define _SDIO_D2_PC10_ 1

#define SDIO_D3_PB5_ PB5,GPIO_AF12
#define SDIO_D3_PC11_ PC11,GPIO_AF12
#define _SDIO_D3_PB5_ 1
#define _SDIO_D3_PC11_ 1

#define SDIO_D4_PB8_ PB8,GPIO_AF12
#define _SDIO_D4_PB8_ 1

#define SDIO_D5_PB9_ PB9,GPIO_AF12
#define _SDIO_D5_PB9_ 1

#define SDIO_D6_PB14_ PB14,GPIO_AF12
#define SDIO_D6_PC6_ PC6,GPIO_AF12
#define _SDIO_D6_PB14_ 1
#define _SDIO_D6_PC6_ 1

#define SDIO_D7_PB10_ PB10,GPIO_AF12
#define SDIO_D7_PC7_ PC7,GPIO_AF12
#define _SDIO_D7_PB10_ 1
#define _SDIO_D7_PC7_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PA12_ PA12,GPIO_AF5
#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define _SPI2_MISO_PA12_ 1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1

#define SPI2_MOSI_PA10_ PA10,GPIO_AF5
#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define _SPI2_MOSI_PA10_ 1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1

#define SPI2_SCK_PA9_ PA9,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PC7_ PC7,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF5
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PC7_ 1
#define _SPI2_SCK_PD3_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB12_ PB12,GPIO_AF7
#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB12_ 1
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SPI4_MISO_PA11_ PA11,GPIO_AF6
#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE5_ PE5,GPIO_AF5
#define _SPI4_MISO_PA11_ 1
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE5_ 1

#define SPI4_MOSI_PA1_ PA1,GPIO_AF5
#define SPI4_MOSI_PE14_ PE14,GPIO_AF5
#define SPI4_MOSI_PE6_ PE6,GPIO_AF5
#define _SPI4_MOSI_PA1_ 1
#define _SPI4_MOSI_PE14_ 1
#define _SPI4_MOSI_PE6_ 1

