susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define SPI4_NSS_PB12_ PB12,GPIO_AF6
#define SPI4_NSS_PE11_ PE11,GPIO_AF5
#define SPI4_NSS_PE4_ PE4,GPIO_AF5
#define _SPI4_NSS_PB12_ 1
#define _SPI4_NSS_PE11_ 1
#define _SPI4_NSS_PE4_ 1

#define SPI4_SCK_PB13_ PB13,GPIO_AF6
#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PE2_ PE2,GPIO_AF5
#define _SPI4_SCK_PB13_ 1
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PE2_ 1

#define SPI5_MISO_PA12_ PA12,GPIO_AF6
#define SPI5_MISO_PE13_ PE13,GPIO_AF6
#define SPI5_MISO_PE5_ PE5,GPIO_AF6
#define _SPI5_MISO_PA12_ 1
#define _SPI5_MISO_PE13_ 1
#define _SPI5_MISO_PE5_ 1

#define SPI5_MOSI_PA10_ PA10,GPIO_AF6
#define SPI5_MOSI_PB8_ PB8,GPIO_AF6
#define SPI5_MOSI_PE14_ PE14,GPIO_AF6
#define SPI5_MOSI_PE6_ PE6,GPIO_AF6
#define _SPI5_MOSI_PA10_ 1
#define _SPI5_MOSI_PB8_ 1
#define _SPI5_MOSI_PE14_ 1
#define _SPI5_MOSI_PE6_ 1

#define SPI5_NSS_PB1_ PB1,GPIO_AF6
#define SPI5_NSS_PE11_ PE11,GPIO_AF6
#define SPI5_NSS_PE4_ PE4,GPIO_AF6
#define _SPI5_NSS_PB1_ 1
#define _SPI5_NSS_PE11_ 1
#define _SPI5_NSS_PE4_ 1

#define SPI5_SCK_PB0_ PB0,GPIO_AF6
#define SPI5_SCK_PE12_ PE12,GPIO_AF6
#define SPI5_SCK_PE2_ PE2,GPIO_AF6
#define _SPI5_SCK_PB0_ 1
#define _SPI5_SCK_PE12_ 1
#define _SPI5_SCK_PE2_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_SWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_SWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_JTRST_PB4_ PB4,GPIO_AF0
#define _SYS_JTRST_PB4_ 1

#define SYS_TRACECLK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECLK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define SYS_TRACED0_PF6_ PF6,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1
#define _SYS_TRACED0_PF6_ 1

#define SYS_TRACED1_PD3_ PD3,GPIO_AF0
#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define SYS_TRACED1_PF7_ PF7,GPIO_AF0
#define _SYS_TRACED1_PD3_ 1
#define _SYS_TRACED1_PE4_ 1
#define _SYS_TRACED1_PF7_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define SYS_TRACED2_PG13_ PG13,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1
#define _SYS_TRACED2_PG13_ 1

#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define SYS_TRACED3_PG14_ PG14,GPIO_AF0
#define _SYS_TRACED3_PE6_ 1
#define _SYS_TRACED3_PG14_ 1

#define TIM10_CH1_PB8_ PB8,GPIO_AF3
#define TIM10_CH1_PF6_ PF6,GPIO_AF3
#define _TIM10_CH1_PB8_ 1
#define _TIM10_CH1_PF6_ 1

#define TIM11_CH1_PB9_ PB9,GPIO_AF3
#define TIM11_CH1_PF7_ PF7,GPIO_AF3
#define _TIM11_CH1_PB9_ 1
#define _TIM11_CH1_PF7_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF9
#define _TIM12_CH1_PB14_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF9
#define _TIM12_CH2_PB15_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PE14_ PE14,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define TIM1_ETR_PF10_ PF10,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1
#define _TIM1_ETR_PF10_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PF3_ PF3,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PF3_ 1

