susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PF4_ PF4,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PF4_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PF5_ PF5,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PF5_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PF10_ PF10,GPIO_AF2
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PF10_ 1

#define TIM8_BKIN_PA6_ PA6,GPIO_AF3
#define TIM8_BKIN_PF12_ PF12,GPIO_AF3
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PF12_ 1

#define TIM8_CH1_PC6_ PC6,GPIO_AF3
#define _TIM8_CH1_PC6_ 1

#define TIM8_CH1N_PA5_ PA5,GPIO_AF3
#define TIM8_CH1N_PA7_ PA7,GPIO_AF3
#define _TIM8_CH1N_PA5_ 1
#define _TIM8_CH1N_PA7_ 1

#define TIM8_CH2_PC7_ PC7,GPIO_AF3
#define _TIM8_CH2_PC7_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF3
#define TIM8_CH2N_PB14_ PB14,GPIO_AF3
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB14_ 1

#define TIM8_CH3_PC8_ PC8,GPIO_AF3
#define _TIM8_CH3_PC8_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF3
#define TIM8_CH3N_PB15_ PB15,GPIO_AF3
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB15_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF3
#define _TIM8_CH4_PC9_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF3
#define TIM8_ETR_PF11_ PF11,GPIO_AF3
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PF11_ 1

#define TIM9_CH1_PA2_ PA2,GPIO_AF3
#define TIM9_CH1_PE5_ PE5,GPIO_AF3
#define _TIM9_CH1_PA2_ 1
#define _TIM9_CH1_PE5_ 1

#define TIM9_CH2_PA3_ PA3,GPIO_AF3
#define TIM9_CH2_PE6_ PE6,GPIO_AF3
#define _TIM9_CH2_PA3_ 1
#define _TIM9_CH2_PE6_ 1

#define UART10_RX_PE2_ PE2,GPIO_AF11
#define UART10_RX_PG11_ PG11,GPIO_AF11
#define _UART10_RX_PE2_ 1
#define _UART10_RX_PG11_ 1

#define UART10_TX_PE3_ PE3,GPIO_AF11
#define UART10_TX_PG12_ PG12,GPIO_AF11
#define _UART10_TX_PE3_ 1
#define _UART10_TX_PG12_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB3_ PB3,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB3_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA15_ PA15,GPIO_AF7
#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA15_ 1
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF8
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PB13_ PB13,GPIO_AF8
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PC5_ PC5,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PA11_ PA11,GPIO_AF11
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define UART4_RX_PD0_ PD0,GPIO_AF11
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PA11_ 1
#define _UART4_RX_PC11_ 1
#define _UART4_RX_PD0_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PA12_ PA12,GPIO_AF11
#define UART4_TX_PD1_ PD1,GPIO_AF11
#define UART4_TX_PD10_ PD10,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PA12_ 1
#define _UART4_TX_PD1_ 1
#define _UART4_TX_PD10_ 1

#define UART5_RX_PB12_ PB12,GPIO_AF11
#define UART5_RX_PB5_ PB5,GPIO_AF11
#define UART5_RX_PB8_ PB8,GPIO_AF11
#define UART5_RX_PD2_ PD2,GPIO_AF8
#define _UART5_RX_PB12_ 1
#define _UART5_RX_PB5_ 1
#define _UART5_RX_PB8_ 1
#define _UART5_RX_PD2_ 1

#define UART5_TX_PB13_ PB13,GPIO_AF11
#define UART5_TX_PB6_ PB6,GPIO_AF11
#define UART5_TX_PB9_ PB9,GPIO_AF11
#define UART5_TX_PC12_ PC12,GPIO_AF8
#define _UART5_TX_PB13_ 1
#define _UART5_TX_PB6_ 1
#define _UART5_TX_PB9_ 1
#define _UART5_TX_PC12_ 1

#define UART6_CK_PC8_ PC8,GPIO_AF8
#define UART6_CK_PG7_ PG7,GPIO_AF8
#define _UART6_CK_PC8_ 1
#define _UART6_CK_PG7_ 1

#define UART6_CTS_PG13_ PG13,GPIO_AF8
#define UART6_CTS_PG15_ PG15,GPIO_AF8
#define _UART6_CTS_PG13_ 1
#define _UART6_CTS_PG15_ 1

#define UART6_RTS_PG12_ PG12,GPIO_AF8
#define UART6_RTS_PG8_ PG8,GPIO_AF8
#define _UART6_RTS_PG12_ 1
#define _UART6_RTS_PG8_ 1

#define UART6_RX_PA12_ PA12,GPIO_AF8
#define UART6_RX_PC7_ PC7,GPIO_AF8
#define UART6_RX_PG9_ PG9,GPIO_AF8
#define _UART6_RX_PA12_ 1
#define _UART6_RX_PC7_ 1
#define _UART6_RX_PG9_ 1

#define UART6_TX_PA11_ PA11,GPIO_AF8
#define UART6_TX_PC6_ PC6,GPIO_AF8
#define UART6_TX_PG14_ PG14,GPIO_AF8
#define _UART6_TX_PA11_ 1
#define _UART6_TX_PC6_ 1
#define _UART6_TX_PG14_ 1

#define UART7_RX_PA8_ PA8,GPIO_AF8
#define UART7_RX_PB3_ PB3,GPIO_AF8
#define UART7_RX_PE7_ PE7,GPIO_AF8
#define UART7_RX_PF6_ PF6,GPIO_AF8
#define _UART7_RX_PA8_ 1
#define _UART7_RX_PB3_ 1
#define _UART7_RX_PE7_ 1
#define _UART7_RX_PF6_ 1

#define UART7_TX_PA15_ PA15,GPIO_AF8
#define UART7_TX_PB4_ PB4,GPIO_AF8
#define UART7_TX_PE8_ PE8,GPIO_AF8
#define UART7_TX_PF7_ PF7,GPIO_AF8
#define _UART7_TX_PA15_ 1
#define _UART7_TX_PB4_ 1
#define _UART7_TX_PE8_ 1
#define _UART7_TX_PF7_ 1

#define UART8_RX_PE0_ PE0,GPIO_AF8
#define UART8_RX_PF8_ PF8,GPIO_AF8
#define _UART8_RX_PE0_ 1
#define _UART8_RX_PF8_ 1

