susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F413.h
#define UART8_TX_PE1_ PE1,GPIO_AF8
#define UART8_TX_PF9_ PF9,GPIO_AF8
#define _UART8_TX_PE1_ 1
#define _UART8_TX_PF9_ 1

#define UART9_RX_PD14_ PD14,GPIO_AF11
#define UART9_RX_PG0_ PG0,GPIO_AF11
#define _UART9_RX_PD14_ 1
#define _UART9_RX_PG0_ 1

#define UART9_TX_PD15_ PD15,GPIO_AF11
#define UART9_TX_PG1_ PG1,GPIO_AF11
#define _UART9_TX_PD15_ 1
#define _UART9_TX_PG1_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB3_ PB3,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB3_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA15_ PA15,GPIO_AF7
#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA15_ 1
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PD7_ PD7,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF7
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD6_ PD6,GPIO_AF7
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD5_ PD5,GPIO_AF7
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB12_ PB12,GPIO_AF8
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PB13_ PB13,GPIO_AF8
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define USART3_RTS_PD12_ PD12,GPIO_AF7
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define USART3_RX_PC5_ PC5,GPIO_AF7
#define USART3_RX_PD9_ PD9,GPIO_AF7
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PD8_ PD8,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PD8_ 1

#define USART6_CK_PC8_ PC8,GPIO_AF8
#define USART6_CK_PG7_ PG7,GPIO_AF8
#define _USART6_CK_PC8_ 1
#define _USART6_CK_PG7_ 1

#define USART6_CTS_PG13_ PG13,GPIO_AF8
#define USART6_CTS_PG15_ PG15,GPIO_AF8
#define _USART6_CTS_PG13_ 1
#define _USART6_CTS_PG15_ 1

#define USART6_RTS_PG12_ PG12,GPIO_AF8
#define USART6_RTS_PG8_ PG8,GPIO_AF8
#define _USART6_RTS_PG12_ 1
#define _USART6_RTS_PG8_ 1

#define USART6_RX_PA12_ PA12,GPIO_AF8
#define USART6_RX_PC7_ PC7,GPIO_AF8
#define USART6_RX_PG9_ PG9,GPIO_AF8
#define _USART6_RX_PA12_ 1
#define _USART6_RX_PC7_ 1
#define _USART6_RX_PG9_ 1

#define USART6_TX_PA11_ PA11,GPIO_AF8
#define USART6_TX_PC6_ PC6,GPIO_AF8
#define USART6_TX_PG14_ PG14,GPIO_AF8
#define _USART6_TX_PA11_ 1
#define _USART6_TX_PC6_ 1
#define _USART6_TX_PG14_ 1

#define USB_OTG_FS_DM_PA11_ PA11,GPIO_AF10
#define _USB_OTG_FS_DM_PA11_ 1

#define USB_OTG_FS_DP_PA12_ PA12,GPIO_AF10
#define _USB_OTG_FS_DP_PA12_ 1

#define USB_OTG_FS_ID_PA10_ PA10,GPIO_AF10
#define _USB_OTG_FS_ID_PA10_ 1

#define USB_OTG_FS_SOF_PA8_ PA8,GPIO_AF10
#define _USB_OTG_FS_SOF_PA8_ 1

#define USB_OTG_FS_VBUS_PA9_ PA9,GPIO_AF10
#define _USB_OTG_FS_VBUS_PA9_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */